app/controllers/fahrenheit_temps_controller.rb

  def index
    @fahrenheit_temps = FahrenheitTemp.all
---
SELECT * FROM "fahrenheit_temps" ORDER BY sampled_at

  def show
    @fahrenheit_temp = FahrenheitTemp.find(params[:id])
---
SELECT * FROM "fahrenheit_temps" WHERE ("fahrenheit_temps"."id" = 2053932785)

  def edit
    @fahrenheit_temp = FahrenheitTemp.find(params[:id])
---
SELECT * FROM "fahrenheit_temps" WHERE ("fahrenheit_temps"."id" = 2053932785)

  def update
    @fahrenheit_temp = FahrenheitTemp.find(params[:id])
---
SELECT * FROM "fahrenheit_temps" WHERE ("fahrenheit_temps"."id" = 2053932785)

  def destroy
    @fahrenheit_temp = FahrenheitTemp.find(params[:id])
    @fahrenheit_temp.destroy
---
SELECT * FROM "fahrenheit_temps" WHERE ("fahrenheit_temps"."id" = 2053932785)
DELETE FROM "fahrenheit_temps" WHERE "id" = 2053932785