app/controllers/report_controller.rb

SELECT * FROM "sources" WHERE ("sources"."name" = E'ds_reader') LIMIT 1
---
  def index
    @report = Report.new(params[:report])
    @report.start = Time.now  - (60 * 60 * 24 * 2) || @report.start
    @sources = Source.find(:all, :order => :name)

SELECT * FROM "sources" WHERE ("sources"."id" = 4)
SELECT * FROM "sources" ORDER BY name
---
  def show


    params[:report][:sources] = params[:report][:sources].collect {|s| Source.find(s.to_i)}


    @report = Report.new(params[:report])
    unless @report.start
      logger.debug("defaulting report start to 2 days ago")
      @report.start = Time.now - (60 * 60 * 24 * 2)
    end
    @source = @report.sources[0]
    unless @source
      return render(  :file =>  "#{RAILS_ROOT}/public/404.html", :status => :not_found)
    end
    @sources = Source.find(:all, :order => :name)

    respond_to do |format|
      format.html {
        @graph = open_flash_chart_object(800,700,url_for(:action => 'show',
                                                         :format => 'json',
                                                         :report => {
                                                           :start => @report.start,
                                                           :end => @report.end,
                                                           :sources =>  @report.sources.collect {|s| s.id }}))

SELECT * FROM "fahrenheit_temps" WHERE (source_id = 4 and sampled_at > '2009-08-27 15:17:20.000000' and sampled_at < '2009-08-29 10:27:21.059073') ORDER BY sampled_at
---
        data1 = []

        report_end = @report.end || Time.now
        temps = FahrenheitTemp.find(:all,
                                    :conditions => [ 'source_id = ? and sampled_at > ? and sampled_at < ?', @source.id,  @report.start, report_end],
                                    :order => :sampled_at)