app/controllers/time_periods_controller.rb

SELECT * FROM "time_periods"
---
  def index
    @time_periods = TimePeriod.all

SELECT * FROM "time_periods" WHERE ("time_periods"."id" = 2053932785)
---
  def show
    @time_period = TimePeriod.find(params[:id])

SELECT * FROM "time_periods" WHERE ("time_periods"."id" = 2053932785)
---
  def edit
    @time_period = TimePeriod.find(params[:id])

SELECT * FROM "time_periods" WHERE ("time_periods"."id" = 2053932785)
---
  def update
    @time_period = TimePeriod.find(params[:id])

SELECT * FROM "time_periods" WHERE ("time_periods"."id" = 2053932785)
DELETE FROM "time_periods" WHERE "id" = 2053932785
---
  def destroy
    @time_period = TimePeriod.find(params[:id])
    @time_period.destroy